# BentFabricBendDirection Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricSheet..::..BentFabricBendDirection Property
FabricSheet Class See Also
---
Specifies which wire direction of the fabric sheet is bent.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public BentFabricBendDirection BentFabricBendDirection { get; set; }
```

Visual Basic
---
```text
Public Property BentFabricBendDirection As BentFabricBendDirection
	Get
	Set
```

Visual C++
---
```text
public:
property BentFabricBendDirection BentFabricBendDirection {
	BentFabricBendDirection get ();
	void set (BentFabricBendDirection value);
}
```

# Remarks
This parameter applies only to bent fabric sheets.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | When setting this property: the data-setting method is not applicable to fabric sheets that are flat |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |
| Autodesk.Revit.Exceptions..::..InvalidObjectException | When setting this property: The data-setting method is not applicable to fabric sheets that are flat. |

# See Also
FabricSheet Class
Autodesk.Revit.DB.Structure Namespace